### ipl Dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data/IPL Matches 2008-2020.csv')

In [3]:
df.shape

(816, 17)

In [7]:
df.columns

Index(['id', 'city', 'date', 'player_of_match', 'venue', 'neutral_venue',
       'team1', 'team2', 'toss_winner', 'toss_decision', 'winner', 'result',
       'result_margin', 'eliminator', 'method', 'umpire1', 'umpire2'],
      dtype='object')

In [4]:
df.columns.tolist()

['id',
 'city',
 'date',
 'player_of_match',
 'venue',
 'neutral_venue',
 'team1',
 'team2',
 'toss_winner',
 'toss_decision',
 'winner',
 'result',
 'result_margin',
 'eliminator',
 'method',
 'umpire1',
 'umpire2']

In [5]:
df.head()

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan

In [6]:
df.tail()

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
811,1216547,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,NaN,Nitin Menon,PR Reiffel
812,1237177,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,NaN,CB Gaffaney,Nitin Menon
813,1237178,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,Royal Challengers Bangalore,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,NaN,PR Reiffel,S Ravi
814,1237180,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,NaN,PR Reiffel,S Ravi
815,1237181,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,NaN,CB Gaffaney,Nitin Menon

In [8]:
df.describe()

                 id  neutral_venue  result_margin
count  8.160000e+02     816.000000     799.000000
mean   7.563496e+05       0.094363      17.321652
std    3.058943e+05       0.292512      22.068427
min    3.359820e+05       0.000000       1.000000
25%    5.012278e+05       0.000000       6.000000
50%    7.292980e+05       0.000000       8.000000
75%    1.082626e+06       0.000000      19.500000
max    1.237181e+06       1.000000     146.000000

In [9]:
max(df['result_margin'])

146.0

In [10]:
int(max(df['result_margin']))

146

#### Question 1:
- **Pick a Row where result_margin column has higest value**

In [11]:
df[df['result_margin'] >= int(max(df['result_margin']))]

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
620,1082635,Delhi,2017-05-06,LMP Simmons,Feroz Shah Kotla,0,Delhi Daredevils,Mumbai Indians,Delhi Daredevils,field,Mumbai Indians,runs,146.0,N,NaN,Nitin Menon,CK Nandan

In [12]:
df.iloc[df['result_margin'].argmax()]

id                          1082635
city                          Delhi
date                     2017-05-06
player_of_match         LMP Simmons
venue              Feroz Shah Kotla
neutral_venue                     0
team1              Delhi Daredevils
team2                Mumbai Indians
toss_winner        Delhi Daredevils
toss_decision                 field
winner               Mumbai Indians
result                         runs
result_margin                   146
eliminator                        N
method                          NaN
umpire1                 Nitin Menon
umpire2                   CK Nandan
Name: 620, dtype: object

In [14]:
df.iloc[df['result_margin'].argmax(),[1,3,4,6,7,10]]

city                          Delhi
player_of_match         LMP Simmons
venue              Feroz Shah Kotla
team1              Delhi Daredevils
team2                Mumbai Indians
winner               Mumbai Indians
Name: 620, dtype: object

### Uploading new Dataset of IPL

In [15]:
matches =  pd.read_csv('Data\matches.csv')

In [16]:
matches.columns

Index(['id', 'season', 'city', 'date', 'team1', 'team2', 'toss_winner',
       'toss_decision', 'result', 'dl_applied', 'winner', 'win_by_runs',
       'win_by_wickets', 'player_of_match', 'venue', 'umpire1', 'umpire2',
       'umpire3'],
      dtype='object')

In [17]:
matches.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2008,Bangalore,2008-04-18,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Kolkata Knight Riders,140,0,BB McCullum,M Chinnaswamy Stadium,Asad Rauf,RE Koertzen,NaN
1,2,2008,Chandigarh,2008-04-19,Chennai Super Kings,Kings XI Punjab,Chennai Super Kings,bat,normal,0,Chennai Super Kings,33,0,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",MR Benson,SL Shastri,NaN
2,3,2008,Delhi,2008-04-19,Rajasthan Royals,Delhi Daredevils,Rajasthan Royals,bat,normal,0,Delhi Daredevils,0,9,MF Maharoof,Feroz Shah Kotla,Aleem Dar,GA Pratapkumar,NaN
3,4,2008,Mumbai,2008-04-20,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,normal,0,Royal Challengers Bangalore,0,5,MV Boucher,Wankhede Stadium,SJ Davis,DJ Harper,NaN
4,5,2008,Kolkata,2008-04-20,Deccan Chargers,Kolkata Knight Riders,Deccan Chargers,bat,normal,0,Kolkata Knight Riders,0,5,DJ Hussey,Eden Gardens,BF Bowden,K Hariharan,NaN

In [18]:
matches.describe()

,id,season,dl_applied,win_by_runs,win_by_wickets,umpire3
count,577.000000,577.000000,577.000000,577.000000,577.000000,0.0
mean,289.000000,2012.029463,0.025997,13.715771,3.363951,NaN
std,166.709828,2.486247,0.159263,23.619282,3.416049,NaN
min,1.000000,2008.000000,0.000000,0.000000,0.000000,NaN
25%,145.000000,2010.000000,0.000000,0.000000,0.000000,NaN
50%,289.000000,2012.000000,0.000000,0.000000,3.000000,NaN
75%,433.000000,2014.000000,0.000000,20.000000,6.000000,NaN
max,577.000000,2016.000000,1.000000,144.000000,10.000000,NaN

#### Question 2:
- Match won by minimum wickets

In [25]:
matches['win_by_wickets'].argmin()

0

In [27]:
matches.iloc[matches[matches['win_by_wickets'].ge(1)].win_by_wickets.argmin()]

id                                   263
season                              2012
city                             Kolkata
date                          2012-04-13
team1                   Rajasthan Royals
team2              Kolkata Knight Riders
toss_winner             Rajasthan Royals
toss_decision                        bat
result                            normal
dl_applied                             0
winner             Kolkata Knight Riders
win_by_runs                            0
win_by_wickets                         5
player_of_match          Shakib Al Hasan
venue                       Eden Gardens
umpire1                        Asad Rauf
umpire2                         S Asnani
umpire3                              NaN
Name: 262, dtype: object

#### Question 3:
- How Do i print unique values of the given columns

In [28]:
matches['season']

0      2008
1      2008
2      2008
3      2008
4      2008
       ...
572    2016
573    2016
574    2016
575    2016
576    2016
Name: season, Length: 577, dtype: int64

In [29]:
matches['season'].unique()

array([2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016], dtype=int64)

In [30]:
matches['season'].unique().tolist()

[2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016]

In [31]:
matches['dl_applied'].unique().tolist()

[0, 1]

- value_count()
    - It counts the values  based on input column

In [32]:
matches['dl_applied'].value_counts()

0    562
1     15
Name: dl_applied, dtype: int64

In [33]:
matches['season'].value_counts()

2013    76
2012    74
2011    73
2016    60
2014    60
2010    60
2015    59
2008    58
2009    57
Name: season, dtype: int64

In [34]:
matches['team1'].value_counts()

Chennai Super Kings            77
Mumbai Indians                 76
Kings XI Punjab                69
Kolkata Knight Riders          62
Royal Challengers Bangalore    62
Delhi Daredevils               57
Rajasthan Royals               54
Deccan Chargers                43
Sunrisers Hyderabad            37
Pune Warriors                  20
Rising Pune Supergiants         7
Kochi Tuskers Kerala            7
Gujarat Lions                   6
Name: team1, dtype: int64

In [35]:
matches['team2'].value_counts()

Royal Challengers Bangalore    77
Delhi Daredevils               76
Kolkata Knight Riders          70
Kings XI Punjab                65
Mumbai Indians                 64
Rajasthan Royals               64
Chennai Super Kings            54
Deccan Chargers                32
Pune Warriors                  26
Sunrisers Hyderabad            25
Gujarat Lions                  10
Rising Pune Supergiants         7
Kochi Tuskers Kerala            7
Name: team2, dtype: int64

In [36]:
matches['umpire1'].value_counts()

HDPK Dharmasena          73
Asad Rauf                51
Aleem Dar                38
BF Bowden                37
AK Chaudhary             34
S Ravi                   34
BR Doctrove              34
M Erasmus                29
RE Koertzen              20
S Asnani                 19
JD Cloete                16
BG Jerling               13
VA Kulkarni              11
SS Hazare                11
RK Illingworth           11
S Das                    10
CB Gaffaney              10
MR Benson                10
K Hariharan              10
DJ Harper                 9
NJ Llong                  9
IL Howell                 7
BNJ Oxenford              7
RM Deshpande              7
GAV Baxter                7
C Shamshuddin             6
SJ Davis                  6
SD Fry                    5
Nitin Menon               5
SK Tarapore               5
KN Ananthapadmanabhan     4
AY Dandekar               4
CK Nandan                 4
A Nand Kishore            3
AM Saheba                 3
PR Reiffel                3
K Bharatan                3
PG Pathak                 2
AV Jayaprakash            2
K Srinath                 2
AK Chowdhary              1
SJA Taufel                1
SL Shastri                1
Name: umpire1, dtype: int64

In [37]:
matches['umpire1'].value_counts()['Nitin Menon']

5

In [38]:
matches['umpire1'].value_counts()[['Nitin Menon','Asad Rauf','Aleem Dar']]

Nitin Menon     5
Asad Rauf      51
Aleem Dar      38
Name: umpire1, dtype: int64

### Group by In Python

In [39]:
df = pd.DataFrame({
    'key1':list('aabbcc'),
    'key2':['one','two','three']*2,
    'data1':np.random.randn(6),
    'data2':np.random.randn(6)
})

In [40]:
df

  key1   key2     data1     data2
0    a    one  0.792387 -1.283725
1    a    two  0.540521  1.115017
2    b  three  1.185928 -0.867078
3    b    one  1.447320  0.630646
4    c    two  0.139708  0.106200
5    c  three -0.058749 -0.506807

In [41]:
res_group = df['data1'].groupby(df['key1'])

In [42]:
res_group

In [43]:
res_group.mean()

key1
a    0.666454
b    1.316624
c    0.040480
Name: data1, dtype: float64

In [44]:
res_group1 = df['data2'].groupby(df['key2'])

In [45]:
res_group1.mean()

key2
one     -0.326540
three   -0.686942
two      0.610609
Name: data2, dtype: float64

In [47]:
res_group2 = df['data1'].groupby([df['key1'],df['key2']]).mean()
res_group2

key1  key2
a     one      0.792387
      two      0.540521
b     one      1.447320
      three    1.185928
c     three   -0.058749
      two      0.139708
Name: data1, dtype: float64

In [48]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.666454 -0.084354
b     1.316624 -0.118216
c     0.040480 -0.200303

In [49]:
df.groupby(['key1','key2']).mean()

               data1     data2
key1 key2
a    one    0.792387 -1.283725
     two    0.540521  1.115017
b    one    1.447320  0.630646
     three  1.185928 -0.867078
c    three -0.058749 -0.506807
     two    0.139708  0.106200

### Iterating over Groups

In [50]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.792387 -1.283725
1    a  two  0.540521  1.115017
b
  key1   key2     data1     data2
2    b  three  1.185928 -0.867078
3    b    one  1.447320  0.630646
c
  key1   key2     data1     data2
4    c    two  0.139708  0.106200
5    c  three -0.058749 -0.506807

### Applications With Real Data Set

In [61]:
df = pd.read_csv('Data\TestsalesGlobale.csv')

In [63]:
df.columns.tolist()

['Rank',
 'Name',
 'Platform',
 'Year',
 'Genre',
 'Publisher',
 'NA_Sales',
 'EU_Sales',
 'JP_Sales',
 'Other_Sales',
 'Global_Sales']

In [64]:
df.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [65]:
df.dropna().describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16291.000000,16291.000000,16291.000000,16291.000000,16291.000000,16291.000000,16291.000000
mean,8290.190228,2006.405561,0.265647,0.147731,0.078833,0.048426,0.540910
std,4792.654450,5.832412,0.822432,0.509303,0.311879,0.190083,1.567345
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4132.500000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8292.000000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12439.500000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.480000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [66]:
df.Global_Sales.mean()

0.53744065550074

In [67]:
res = df.groupby('Genre')

In [68]:
res.count()

,Rank,Name,Platform,Year,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Genre,,,,,,,,,,
Action,3316,3316,3316,3253,3309,3316,3316,3316,3316,3316
Adventure,1286,1286,1286,1276,1282,1286,1286,1286,1286,1286
Fighting,848,848,848,836,846,848,848,848,848,848
Misc,1739,1739,1739,1710,1712,1739,1739,1739,1739,1739
Platform,886,886,886,876,884,886,886,886,886,886
Puzzle,582,582,582,571,581,582,582,582,582,582
Racing,1249,1249,1249,1226,1248,1249,1249,1249,1249,1249
Role-Playing,1488,1488,1488,1471,1486,1488,1488,1488,1488,1488
Shooter,1310,1310,1310,1282,1308,1310,1310,1310,1310,1310
Simulation,867,867,867,851,863,867,867,867,867,867
Sports,2346,2346,2346,2304,2343,2346,2346,2346,2346,2346
Strategy,681,681,681,671,678,681,681,681,681,681

In [69]:
res['Global_Sales'].count()

Genre
Action          3316
Adventure       1286
Fighting         848
Misc            1739
Platform         886
Puzzle           582
Racing          1249
Role-Playing    1488
Shooter         1310
Simulation       867
Sports          2346
Strategy         681
Name: Global_Sales, dtype: int64

In [70]:
res['JP_Sales'].count()

Genre
Action          3316
Adventure       1286
Fighting         848
Misc            1739
Platform         886
Puzzle           582
Racing          1249
Role-Playing    1488
Shooter         1310
Simulation       867
Sports          2346
Strategy         681
Name: JP_Sales, dtype: int64